{
  "dish_name": "Extra Tangy Sourdough Bread",
  "author": "King Arthur Flour",
  "source": "www.kingarthurflour.com/recipes/extra-tangy-sourdough-bread-recipe",
  "notes": "Just a note, this recipe takes a good starter and about 24 hours to execute.",
  "ingredients": [
    "1 cup (227g) ripe (fed) sourdough starter",
    "1 1/2 cups (340g) lukewarm water",
    "5 cups (602g) unbleached all-purspose flour, divided",
    "2 1/2 teaspoons salt"
  ],
  "method": [
    "Combine the starter, water, and 3 cups (12 3/4 ounces, 362g) of the flour. Beat vigorously for 1 minute.",
    "Cover, and let rest at room temperature for 4 hours. Refrigerate overnight, for about 12 hours.",
    "Add the remaining 2 cups (8 1/2 ounces, 241g) flour, and the salt. Knead to form a smooth dough.",
    "Allow the dough to rise in a covered bowl until it's light and airy, with visible gas bubbles. Depending on the vigor of your starter, this may take up to 5 hours (or even longer), depending on how active your starter is. For best results, gently deflate the dough once an hour by turning it out onto a lightly floured work surface, stretching and folding the edges into the center, and turning it over before returning it to the bowl. Adding these folds will give you a better sense of how the dough is progressing, as well as strengthen it.",
    "Gently divide the dough in half.",
    "Gently shape the dough into two rounds or oval loaves, and place them on a lightly greased or parchment-lined baking sheet. Cover with lightly greased plastic wrap and let rise until very puffy, about 2 to 4 hours (or longer; give them sufficient time to become noticeably puffy). Don't worry if the loaves spread more than they rise; they'll pick up once they hit the oven's heat. Towards the end of the rising time, preheat the oven to 425°F.",
    "Spray the loaves with lukewarm water.",
    "Slash the loaves. If you've made round loaves, try one slash across the center, and a curved slash on each side of it; or slash in the pattern of your choice. For oval loaves, two diagonal slashes are fine. Make the slashes fairly deep; a serrated bread knife, wielded firmly, works well here.",
    "Bake the bread for 25 to 30 minutes, until it's a very deep golden brown. Remove it from the oven, and cool on a rack.",
    "Store bread, loosely wrapped in plastic, for several days at room temperature; freeze for longer storage."
  ]
}
