{
  "dish_name": "Sourdough Baguettes",
  "author": "King Arthur Flour",
  "source": "King Arthur Flour",
  "notes": "Yields 6 baguettes. Halved recipe in parens. Total time for this recipe is about 3 hrs 10 mins.",
  "ingredients": [
    "283 g (142 g) warm water",
    "482 g (241 g) sourdough starter",
    "540 g (270 g) or more flour",
    "15 g (7.5 g) salt",
    "2 teaspoons (1 tsp) sugar",
    "1 to 2 teaspoons (0.5 to 1 tsp) instant yeast",
    "4 teaspoons (2 tsp) vital wheat gluten"
  ],
  "method": [
    "In a large bowl, combine the water, starter, and 360 g (180 g) of the flour, mixing until smooth.",
    "Stir in the salt, sugar, yeast, and gluten, then an additional 180 g to 240 g (90 g to 120 g) of flour. Stir until the dough pulls away from the sides of the bowl, adding only enough additional flour as necessary; a slack (sticky) dough makes a light loaf.",
    "Knead the dough for about 7 minutes in a stand mixer; or 8 to 10 minutes by hand, on a lightly greased work surface. You may also knead this dough using the dough cycle on your bread machine; once it's finished kneading, transfer it to a bowl to rise, as directed below.",
    "Turn the dough into an oiled bowl, cover the bowl, and let the dough rise until doubled in bulk, about 90 minutes.",
    "Gently deflate the dough, and divide it into six pieces (for thin baguettes) or three pieces (for thicker Italian loaves).",
    "Shape each piece into a 16'' long loaf, and place the loaves, at least 4'' apart, on parchment-lined baking sheets, or in lightly greased baguette pans (French loaf pans). If you're using baguette pans, make the loaves 15'' long.",
    "Cover the loaves with lightly greased plastic wrap, and let them rise for 1 1/2 to 2 hours, or until they're nice and puffy. Towards the end of the rising time, preheat your oven to 450°F.",
    "For a classic look, make three diagonal slashes in each loaf, cutting about 1/4'' deep. For taller, rounder baguettes, don't slash.",
    "Bake the baguettes for about 25 minutes, or until they're a rich golden brown. If you baked in baguette pans, remove the loaves from the oven and unmold. Turn off the oven, return the loaves (without the pan) to the oven, and crack the oven door open a few inches. If you baked on a parchment-lined baking sheet, simply turn off the oven and crack the oven door open a few inches. Letting the loaves cool right in the turned-off oven helps preserve their crunchy crust.",
    "Remove the baguettes from the oven, and cool them completely on a rack. Store any leftovers in a paper bag for a day or so; paper will preserve their crunchy crust better than plastic. Freeze for longer storage."
  ]
}
