{
  "dish_name": "Sourdough Pizza Crust",
  "author": "King Arthur Flour",
  "source": "King Arthur Flour",
  "notes": "Yields one 14\" round or two 12\" rounds. Sourdough bakers are always on the lookout for creative ways to put unfed starter to use. In the case of this pizza crust, the open crumb and distinctive hearty taste of sourdough are well suited to bold toppings and well-aged cheeses.",
  "ingredients": [
    "1 cup (227g) sourdough starter, unfed/discard",
    "$\\frac{1}{2}$ cup (113g) lukewarm water",
    "$2\\frac{1}{2}$ cups (298g) all purpose flour",
    "1 teaspoon salt",
    "$\\frac{1}{2}$ teaspoon instant or active dry yeast",
    "4 teaspoons pizza dough flavor, optional (maybe onion powder, garlic powder, etc?)"
  ],
  "method": [
    "Stir any liquid on top of your refrigerated starter back into it before measuring 1 cup (227g) into a large mixing bowl.",
    "Add the water, flour, salt, yeast, and Pizza Dough Flavor (if using). Mix to combine, then knead for about 7 minutes in a mixer with the dough hook, until the dough wraps itself around the hook and cleans the side of the bowl.",
    "Place the dough in a greased container, cover and let rise until almost doubled in bulk. Depending on the vitality of your starter, this will take between 2 and 4 hours. For a faster rise, place the dough in a warm spot, or double the yeast.",
    "For two thin-crust pizzas, divide the dough in half, and shape each into a flattened disk. Drizzle two 12\" round pizza pans with olive oil, and brush to coat the bottom. Place the dough in the pans, cover, and let rest for 15 minutes. After this rest, gently press the dough toward the edges of the pans. If it starts to shrink back, cover and let rest for 15 minutes before continuing.",
    "For a thicker, large pizza, oil a 14\" round pizza pan (an 18\" x 13\" half-sheet pan will also work). Place the dough in the selected pan and press it out to the edges, again giving it a 15-minute rest before continuing if it starts to snap back.",
    "Cover the pan(s) and let the dough rise until it's as thick as you like.",
    "Towards the end of the rise time, preheat your oven to 450°F.",
    "Sauce and top as you like, but don't add cheese yet. Bake thin-crust pizzas for 5 minutes before removing from the oven and adding cheese. For thick-crust pizza, bake for 10 minutes before removing from the oven and adding cheese. Return to the oven and bake for 5 to 7 more minutes, until the cheese is melted."
  ]
}
